#Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.

a = int(input("Ведите любое действительное число: "))
b = int(input("Введите ещё одно действительное число: "))

sum_num = a+b
dif_num = a-b
mult_num = a*b

print("Сумма ваших чисел = " + str(sum_num))
print("Разность ваших чисел = " + str(dif_num))
print("А произведение ваших чисел = " + str(mult_num))



