# Создать строку равную предпоследнему символу введенной строки.
a = input('Введите прозвольное слово или символы: ')
b = a[-1]

print(f'Ваш последний сивол - это {b}')