# Создать строку равную первым пяти символам введенной строки.
a = input('Введите прозвольное слово или символы: ')
b = a[0:6]

print(f'Ваш первые пять сиволов - это {b}')