# Создать строку равную третьему символу введенной строки.

a = input('Введите прозвольное слово или символы: ')
b = a[2]

print(f'Ваш третий сивол - это {b}')